#+TITLE: registry.k8s.io Demo
#+AUTHOR: Caleb Woodbine <caleb@ii.coop>

** Setup
#+begin_src shell
echo Distritest1234! | nerdctl login envoy.ii-sandbox.$SHARINGIO_PAIR_BASE_DNS_NAME -u distribution --password-stdin
#+end_src

#+RESULTS:
#+begin_example
Login Succeeded
#+end_example

#+begin_src shell :results silent
cat << EOF >> $HOME/.bashrc
alias docker="sudo --preserve-env /usr/local/go/bin/nerdctl"
EOF
#+end_src

#+begin_src shell
mv registry-k8s-io-demo_client.html public_html/index.html ; mv registry-k8s-io-demo.html public_html/presenter.html
#+end_src

#+RESULTS:
#+begin_example
#+end_example

Obtain a token for reveal_multiplex
#+begin_src shell :wrap "SRC json"
curl -s https://reveal-multiplex.ii-sandbox.bobymcbobs-oitq.pair.sharing.io/token
#+end_src

#+RESULTS:
#+begin_SRC json
{"secret":"16220212557349309458","socketId":"9e54e4f78719753d"}
#+end_SRC

